
# This is the user-interface definition of a Shiny web application.
# You can find out more about building applications with Shiny here:
#
# http://shiny.rstudio.com
#

library(shiny)

shinyUI( navbarPage(
                    "Περιτοναϊκή Κάθαρση",
                    theme = "bootstrap.css",
                  tabPanel("Οδηγίες",
                           fluidRow(column(width = 12),
                                    
                                    br(),
                                    tags$h2("Πιλοτική έκδοση Εφαρμογής Yπολογισμού Ρυθμού Εμφάνισης Περιτονίτιδας"),
                                    hr(),
                                    br(),
                                    tags$area("Για τον υπολογισμό του ετήσιου ρυθμού περιτονίτιδας, ο χρήστης θα πρέπει να ακολουθήσει τα εξής βήματα:
                                              "),
                                    tags$h3("Επιλογή Αρχείου"),
                                    tags$ol(
                                    tags$li("Επιλογή έτους - Ο χρήστης θα πρέπει να επιλέξει το έτος για το οποίο θα υπολογισθεί ο ρυθμός περιτονίτιδας."),
                                    tags$li(p("Ο χρήστης θα πρέπει εισάγει ένα αρχείο τύπου comma delimited. Όλες οι υπολογιστικές και στατιστικές εφαρμογές επιτρέπουν την μετατροπή ή δημιουργία αρχείου comma delimited. 
                                           Στην Επιλογή Αρχείου μπορείτε να κατεβάσετε ένα δείγμα αρχείου.")),
                                    
                                    tags$li("Το επιλεγμένο αρχείο θα πρέπει να εμφανίζεται σε μορφή πίνακα. Εάν δεν εμφανίζεται σε μορφή πίνακα, επιλέξτε το κατάλληλο διαχωριστή (separator) - comma or semi-colon or tab.")
                                    ),
                                    tags$h3("Ετήσιο ρυθμός περιτονίτιδας"),
                                    tags$ol(
                                      tags$li("Πατήστε το κουμπί Υπολογισμός και θα εμφανισθεί το αποτέλεσμα. Σε περίπτωση μη εμφάνισης αποτελέσματος, πιθανόν το αρχείο να παρουσίαζει κάποιο πρόβλημα. "),
                                      tags$p("Το αρχείο θα πρέπει να αποτελείται απο τις παρακάτω στήλες δεδομένων:"),
                                      tags$ol(
                                      tags$li("patient - Όνομα Ασθενή"),
                                      tags$li("dateofstart - Ημερομηνία έναρξης θεραπείας (παντα εισάγετε την ημερομηνια με την μορφή ΗΗ/ΜΜ/ΕΕΕΕ - 21/10/2014"),
                                      tags$li("dateofdeath - Εισαγετε την ημερομηνια θανάτου ή διακοπής θεραπειας ασθενή ή αφήνετε κενό ή εισάγετε την τιμή ΝΑ (Not Available)"),
                                      tags$li("episode - Εαν ο σθενής παρουσιάζει επεισόδιο λοίμωξης, εισαγετε την τιμή 1. Στην αντίθετη περίπτωση, εισάγετε την τιμή μηδέν 0."),
                                      tags$li("dateofinfection - Εισάγετε την Ημερομηνία εμφάνισης επεισοδίου λοίμωξης ή αφηνετε κενό ή εισαγετε ΝΑ (Not Available)")
                                      )
                                    ),
                                    tags$h3("Ετήσια Έκθεση"),
                                    tags$ol(
                                      tags$li("Εισάγεται το όνομα της Κλινικής και του Ιατρού "),
                                      tags$li("Πατήστε το κουμπί download. Το αρχείο AnnualReport_PeriotnitisRate.docx θα δημιουργηθεί και θα εμφανιστεί στο φάκελο Λήψεις.")
                                    ),
                                   
                                    
                                    tags$p("Ερωτήσεις/Παρατηρήσεις στην ηλεκτρονική διεύθυνση:",
                                    tags$a(href="mailto:melinagavriilidou@hotmail.gr", "Μελίνα Γαβριηλίδου")),
                                      
                                    br(),
                                    tags$p("Created by:",
                                    tags$a("Melina Gavriilidou", 
                                           href="https://gr.linkedin.com/pub/melina-gavriilidou/58/55/284")
                                    ))
                           
                                    
                           ),  
                  tabPanel("Επιλογή Αρχείου", 
                            titlePanel("Αρχείο"),
                           sidebarLayout(
                             sidebarPanel(
                               
                               selectInput(
                                 inputId =  "year", 
                                 label = "Επιλέξτε Έτος:",
                                 selected = "2015",
                                 choices = 2000:2100
                               ),
                              
                               fileInput('file1', 'Εισάγετε το αρχείο ασθενών',
                                         accept=c('text/csv', 
                                                  'text/comma-separated-values,text/plain', 
                                                  '.csv')),
                               p("Tο αρχείο σας πρέπει να είναι τύπου Comma Delimited File (.csv). Κατέβαστε ένα δείγμα αρχείου.", downloadLink('downloadData', 'Download File')),
                               
                               checkboxInput('header', 'Header', TRUE),
                               
                               p("Επιλέξτε τον κατάλληλο διαχωριστή για το αρχείο σας. Τα δεδομένα του αρχείου θα πρέπει να εμφανίζονται ανα στήλη."),
                               
                               radioButtons('sep', 'Separator',
                                            c(Comma=',',
                                              Semicolon=';',
                                              Tab='\t'),
                                            ';'),
                               radioButtons('quote', 'Quote',
                                            c(None='',
                                              'Double Quote'='"',
                                              'Single Quote'="'"),
                                            '"')
                               
                              
                              ),
                              mainPanel(
                                     
                                   dataTableOutput(outputId="contents"))
                                
                           )
                    ),
                    tabPanel("Ετήσιο Ρυθμός Περιτονίτιδας",
                             
                               sidebarLayout(
                                 sidebarPanel(
                                   h3("Υπολογισμος ετήσιου ρυθμού εμφάνισης περιτονίτιδας"),
                                   
                                   p("Ως ρυθμός εμφάνισης (υπολογισμός όλων των λοιμώξεων και κάθε οργανισμού) είναι ο αριθμός λοιμώξεων από οργανισμούς για μία περίοδο, διαιρούμενα από τα χρόνια περιτοναϊκής κάθαρσης σε κίνδυνο, εκφραζόμενα ως επεισόδια ανά έτος ασθενών (episodes per year)."),
                                  
                                   p("Πατήστε το κουμπι για να υπολογίσετε τον ρυθμό έμφανισης Περιτονίτιδας σύμφωνα μετά δεδομένα που έχετε εισάγει."),
                                   
                                   actionButton("goButton", "Υπολογισμός")
                                   ),
                                 mainPanel(
                                   
                                  
                                   h3("Σχετικά με τον ρυθμός εμφάνισης περιτονίτιδας"),
                                   
                                   p("Σύμφωνα με την Διεθνή Νεφρολογική Κοινότητα ο ρυθμός εμφάνισης δεν θα πρέπει να είναι περισσότερα από ένα επεισόδια ανά 18 μήνες (0.67/έτος ασθενών), αν και ρυθμός εμφάνισης θα εξαρτηθεί από τον σύνολο των ασθενών.  Παρόλα αυτά, ο χαμηλός ρυθμός εμφάνισης ενός επεισοδίου κάθε 41-52 μήνες (0.29 - 0.32 /έτος) είναι ο επιδιωκόμενος στόχος."),
                                        
                                   
                                   textOutput('sum')
                                   
                                   
                                 )
                               )
                               
                             ),
                    tabPanel("Ετήσια Έκθεση",
                             
                             
                             sidebarLayout(
                               sidebarPanel(
                                 
                                 p("Εισάγεται όνομα Κλινικής και Ιατρού για την δημιουργία ετήσιας έκθεσης"),
                                 textInput("clinic", label = "Κλινική", value = ""),
                                 textInput("author", label = "Ιατρός", value = ""),
                              #   radioButtons('format', 'Επιλέξτε τύπου αρχείου', c('HTML', 'Word'),inline = TRUE),
                                 downloadButton('downloadReport')
                                 
                                
                                 ),
                               mainPanel(
                                 
                                 h3("Ετήσια Έκθεση Περιτονίτιδας"),
                                 
                                 p("Η Ετήσια Έκθεση Περιτονίτιδας περιλαμβάνει πληροφορίες όπως  
                                    όνομα Νεφρολογικής Κλινικής, όνομα Νεφρολόγου, Ημερομηνία έκδοσης έκθεσης και τον
                                   ρυθμό εμφάνισης περιτονίτιδας του τρεχοντος έτους"),
                                 
                                 p("Το αρχείο είναι σε μορφή Word Document (.docx)")
                                 
                                 
                                
                                 
                          
                               )
                             )
                          )
                  
  
  
))


